{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "transpose", 
      "name": "transpose0", 
      "attrs": {"axes": "(1, 0, 2)"}, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "rnn_0parameters", 
      "attrs": {"__init__": "[\"fusedrnn\", {\"init\": null, \"num_hidden\": 100, \"num_layers\": 1, \"mode\": \"rnn_tanh\", \"bidirectional\": false, \"forget_bias\": 1.0}]"}, 
      "inputs": []
    }, 
    {
      "op": "_zeros", 
      "name": "rnn_0begin_state_0", 
      "attrs": {
        "__layout__": "LNC", 
        "dtype": "float32", 
        "shape": "(1, 0, 100)"
      }, 
      "inputs": []
    }, 
    {
      "op": "RNN", 
      "name": "rnn_0rnn", 
      "attrs": {
        "__layout__": "LNC", 
        "bidirectional": "False", 
        "mode": "rnn_tanh", 
        "num_layers": "1", 
        "p": "0.0", 
        "state_outputs": "True", 
        "state_size": "100"
      }, 
      "inputs": [[1, 0, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "split0", 
      "attrs": {
        "axis": "0", 
        "num_outputs": "28", 
        "squeeze_axis": "1"
      }, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "affine1_weight", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "affine1_bias", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "affine1", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": [[5, 27, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "sigmoid1", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "affine2_weight", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "affine2_bias", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "affine2", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": [[9, 0, 0], [10, 0, 0], [11, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "label", 
      "inputs": []
    }, 
    {
      "op": "SoftmaxOutput", 
      "name": "softmax", 
      "inputs": [[12, 0, 0], [13, 0, 0]]
    }
  ], 
  "arg_nodes": [0, 2, 6, 7, 10, 11, 13], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    6, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43
  ], 
  "heads": [[14, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 1201]}
}